package by.jb29.mod1.les02;

//Вычислить значение выражения по формуле (все переменные принимают действительные значения):


public class Task09 {

	public static void main(String[] args) {
		
		double a = 13;
		double b = 71;
		double c = 44;
		double d = 10;
		
		double z;
		z = (a / c) * (b / d) - ((a * b - c) / (c * d));
		
				
		System.out.println("Значение выражения равно " + z);

	}

}
